{"pageProps":{"post":{"slug":"reunion-0-1","content":"\r\nYesterday (01/05/2022) we made our first reunion, sadly with only two of us personally and one via Google Meet. But even in this situation, we did a lot of progress.\r\n\r\n-   We choose a font: Robot for the body of every text (Maybe try Open Sans in the future).\r\n-   We tried some palette colors \r\n-   Improve the overall CSS structure with new variables\r\n\r\n## Choosing Fonts\r\nTo choose the font we made some kind of display of the possible options. Between the options was:\r\n\r\n- Mukto\r\n- Inconsolata\r\n- Open Sans\r\n- Roboto\r\n- Nunito\r\n\r\nWe ended up with Roboto, just because the time was running out. Maybe I will test some Open Sans in the future\r\n\r\n\r\n## Trying Palettes\r\n\r\nIt was a lot of fun and we are excited to improve each time more this website and write new and improved articles here.\r\n\r\n  \r\nBetween the pallets tested we have these:\r\n\r\n![mouse-palette](/images/posts/reunion-0-1/mouse-palette.webp)\r\n\r\n---\r\n\r\n![granito-palette](/images/posts/reunion-0-1/granito-palette.webp)\r\n\r\n---\r\n\r\n![baleia-palette](/images/posts/reunion-0-1/baleia-palette.webp)\r\n\r\n---\r\n\r\n![cimento-palette](/images/posts/reunion-0-1/cimento-palette.webp)\r\n\r\n----\r\n\r\nI liked the gray one. But will try nome others in the future, thus it's nothing defined yet. Maybe a bluer grey. \r\n\r\n  \r\n\r\nTo improve the palette swap I created many variables to centralize the styles of the website. In the future, I want to make a Dark Theme as well, but to do this will need to make some changes again. \r\n\r\n  \r\n\r\nAnd to document the moment, we decided to shoot some photos *(and I made some effects by hand)*:\r\n\r\n![painted-1](/images/posts/reunion-0-1/painted-us.webp)","author":"renato","cover_image":"https://i.imgur.com/d3iChWE.png","categories":["BLOG"],"date":"01/06/2022","excerpt":"The progress made in our first company reunion","title":"Reunion 0.1","code_theme":null}},"__N_SSG":true}